In [0]:
%matplotlib inline

import numpy as np
import matplotlib.pyplot as plt

import pandas as pd

In [0]:
# reading csv file 
df = pd.read_csv('grade.csv')
type(df)

pandas.core.frame.DataFrame

## 計算總和

In [0]:
df['Total'] = df[['國文','英文','數學']].sum(1)
df

      姓名  國文  英文   數學  物理  Total
0  Amber  90  88  100  66    278
1    Ben  75  63   87  73    225
2    Cat  62  78   89  84    229
3    Dee  79  84   93  99    256

In [0]:
columns_list = ['姓名','國文','英文','數學','物理']
df = pd.read_csv('grade.csv')
df

      姓名  國文  英文   數學  物理
0  Amber  90  88  100  66
1    Ben  75  63   87  73
2    Cat  62  78   89  84
3    Dee  79  84   93  99

## 新增一筆資料

In [0]:
new_df = pd.DataFrame([['Coco','70','89','66','77']],columns=['姓名','國文','英文','數學','物理'])
df = df.append(new_df)
df

      姓名  國文  英文   數學  物理
0  Amber  90  88  100  66
1    Ben  75  63   87  73
2    Cat  62  78   89  84
3    Dee  79  84   93  99
0   Coco  70  89   66  77

In [0]:
# Total = df['國文'].sum()
# 大家國文總和306
# print (Total)

df.loc["Total", "國文"] = df.國文.sum()
df

          姓名     國文    英文     數學    物理  Total
0      Amber   90.0  88.0  100.0  66.0  278.0
1        Ben   75.0  63.0   87.0  73.0  225.0
2        Cat   62.0  78.0   89.0  84.0  229.0
3        Dee   79.0  84.0   93.0  99.0  256.0
Total    NaN  306.0   NaN    NaN   NaN    NaN

## 篩選條件(Select * from xxx where %%)

In [0]:
# 產生4x3 np.array
mydata = np.random.randn(4,3)
mydata

array([[-1.15638755,  1.06441659, -0.52428497],
       [-0.44077494, -1.99188675,  0.26826297],
       [-1.03146577,  0.1620471 ,  0.01572869],
       [ 0.37633581, -0.74873331,  0.51622319]])

In [0]:
# 賦予欄位名稱
df1 = pd.DataFrame(mydata, columns=list('ABC'))
df1

          A         B         C
0  0.343798 -0.802161 -0.131749
1 -0.464499 -0.917438 -0.554791
2  0.300227 -0.533084  1.554493
3  0.165401  1.628790  1.365740

In [0]:
df1 = df1[df1['A'] > 0]
df1

          A         B         C
0  0.343798 -0.802161 -0.131749
2  0.300227 -0.533084  1.554493
3  0.165401  1.628790  1.365740

## Group by

In [0]:
url = 'https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/ufo.csv'
df = pd.read_csv(url, encoding='utf-8')
df.head(5)

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [0]:
df_state = df.groupby('State').count()
df_state.sort_values(by='Time', ascending=False)

## loc 使用

In [0]:
df = pd.DataFrame(np.random.randn(5,3), columns = list('ABC'))
df

          A         B         C
0  0.104416 -0.945888 -0.053509
1  1.027422  0.240065 -0.202162
2 -0.557024  1.129601 -0.593095
3  0.989690 -1.100153 -0.424156
4  0.867633  0.126914 -0.086833

In [0]:
df.loc[2,'B']

1.1296014626887423